Repository: common-repository/woo-esto
Catalog: assets/i18n/woo-esto-*.po
Languages: et

source: Pay in three equal instalments 3 x %s
et: Tasu kolme võrdse maksena 3 x %s

source: Monthly payment from %s
et: Kuumakse al. %s

source: ESTO Woocommerce Settings
et: ESTO WooCommerce sätted

source: Show Esto 3 monthly payment instead of the regular
et: Näita Esto 3 kuumakset tavalise asemel

source: Show monthly payment on shop and category pages
et: Näita kuumakset poe ja kategooriate vaadetes

source: Save Settings
et: Salvesta sätted

source: %d month
et: %d kuu

source: Settings
et: Sätted

source: ESTO payment gateway
et: ESTO maksemoodul

source: Payment module for paying with ESTO regular hire purchase
et: Maksemoodul ESTO järelmaksuga maksmiseks

source: Live mode
et: Live olek

source: Test mode
et: Test olek

source: Estonia
et: Eesti

source: Lithuania
et: Leedu

source: Latvia
et: Läti

source: Enable/Disable
et: Luba/Keela

source: Enable ESTO payment module
et: Luba ESTO maksemoodul

source: Title
et: Pealkiri

source: This controls the title which the user sees during checkout.
et: Pealkiri, mida klient näeb makseviisi valides.

source: ESTO hire purchase
et: ESTO järelmaks

source: Description
et: Kirjeldus

source: This controls the description which the user sees during checkout.
et: Kirjeldus, mida klient näeb makseviisi valides.

source: Confirm a purchase in 60 seconds and pay in installments, conveniently and quickly. Just pay later!
et: Vormista ost 60 sekundiga ning tasu osade kaupa, mugavalt ja kiirelt. Lihtsalt maksa hiljem!

source: Show logo
et: Näita logo

source: Show ESTO logo in checkout
et: Näita ESTO logo kassas

source: Click on logo to replace it.
et: Logo vahetamiseks vajuta sellele.

source: Payment method mode
et: Maksemeetodi olek

source: Test mode is for development purposes and does not create an actual transaction
et: Test olek on mõeldud arenduseks ning päris ostu ESTO's ei sooritata

source: Select endpoint
et: Vali otspunkt

source: Choose the correct endpoint to use, depending on your country
et: Vali enda riigi jaoks õige endpoint

source: Shop ID
et: Poe ID

source: Shop ID is set by ESTO and can be obtained here
et: Poe ID on seatud ESTO poolt ning on saadaval siin

source: Secret API key
et: Salajane API võti

source: Secret API key can be obtained here and should be kept secret
et: Salajast API võtit saab siit ning seda peab hoidma salajas

source: Endpoint for Estonia
et: Endpoint Eesti jaoks

source: Use different endpoint for Estonia?
et: Kasuta Eesti jaoks erinevat endpointi?

source: Shop ID for Estonia
et: Poe ID Eesti jaoks

source: Secret API key for Estonia
et: Salajane API võti Eesti jaoks

source: Endpoint for Latvia
et: Endpoint Läti jaoks

source: Use different endpoint for Latvia?
et: Kasuta Läti jaoks erinevat endpointi?

source: Shop ID for Latvia
et: Poe ID Läti jaoks

source: Secret API key for Latvia
et: Salajane API võti Läti jaoks

source: Endpoint for Lithuania
et: Endpoint Leedu jaoks

source: Use different endpoint for Lithuania?
et: Kasuta Leedu jaoks erinevat endpointi?

source: Shop ID for Lithuania
et: Poe ID Leedu jaoks

source: Secret API key for Lithuania
et: Salajane API võti Leedu jaoks

source: Min amount
et: Minimaalne summa

source: Max amount
et: Maksimaalne summa

source: Only specific countries
et: Ainult valitud riigid

source: Specify countries where this payment method is available. Takes priority over "disabled countries". Leave empty to sell everywhere.
et: Vali riigid, milles see maksemeetod on saadaval. Arvestatakse enne "keelatud riigid" valikut. Jäta tühjaks, kui soovid müüa igal pool.

source: Disabled countries
et: Keelatud riigid

source: Disabled countries for this method
et: Selle maksemeetodi jaoks keelatud riigid

source: Show description logo
et: Näita kirjelduses logo

source: Show ESTO logo in payment method description
et: Näita ESTO logo maksemeetodi kirjelduses

source: Description logo in %s
et: Kirjelduse logo %s keeles

source: Click on logo to replace it or enter url above.
et: Logo vahetamiseks vajuta sellele või sisesta ülal URL.

source: Main logo in %s
et: Põhilogo %s keeles

source: Description logo
et: Kirjelduse logo

source: Choose logo
et: Vali logo

source: Set Logo
et: Määra logo

source: Shop ID is required!
et: Poe ID vajalik!

source: Secret key is required!
et: Salajane API võti vajalik!

source: Min amount is required!
et: Minimaalne summa on vajalik!

source: Max amount is required!
et: Maksimaalne summa on vajalik!

source: Thank you for the order, please click on the button to proceed.
et: Aitäh tellimuse eest, palun vajutage nupu, et liikuda edasi.

source: Thank you for the order. You will be redirected to ESTO...
et: Aitäh tellimuse eest. Teid suunatakse edasi ESTO lehele...

source: Card payment (ESTO Pay)
et: Kaardimakse (ESTO Pay)

source: ESTO Pay card payments are Visa and Mastercard credit/debit card payments. Contact ESTO Partner Support for additional information and activation.
et: ESTO Pay kaardimaksed on Visa ja Mastercard krediit-/deebetkaardi maksed. Lisainformatsiooni saamiseks ja aktiveerimiseks võta ühendust ESTO partnertoega.

source: Pay by card (Visa/Mastercard)
et: Maksa kaardiga (Visa/Mastercard)

source: Payment is made using a secure payment solution.
et: Makse sooritamisel kasutatakse turvalist maksesüsteemi.

source: Show Visa/Mastercard logo in checkout
et: Näita Visa/Mastercard logo kassas

source: Pay Later
et: Maksa hiljem

source: ESTO Pay Later payment gateway
et: ESTO "maksa hiljem" maksemoodul

source: Buy now, pay later!
et: Maksa hiljem

source: Pay Later gives you an extra 30 days to pay for your order. Get the service or goods instantly and pay whenever you like within the next 30 days, with no additional fees!
et: Kinnita tellimus kohe ja ESTO annab sulle 30 päeva lisaaega maksmiseks. Omanda kaup või teenus koheselt ning maksa vastavalt enda soovile järgneva 30 päeva jooksul ilma ühegi lisanduva kuluta! Puudub intress. Puuduvad lisakulud.

source: ESTO Pay bank payments are a direct payment method for all Baltic and Finnish banklinks. Contact ESTO Partner Support for additional information and activation.
et: ESTO Pay pangamaksed on maksemeetod, millega saab maksta kõikide Baltikumi ja Soome pankadega. Lisainformatsiooni saamiseks ja aktiveerimiseks võta ühendust ESTO partnertoega.

source: ESTO Pay payment gateway
et: ESTO Makse maksemoodul

source: ESTO Pay is a direct payment method for credit cards, banklinks, etc. Contact ESTO support for additional information.
et: Tasu SEB, Swedbanki, LHV, Coopi, Luminori või Citadele pangamaksega või Revolutiga. Võimalik tasuda ka Läti, Leedu või Soome pangamaksega. Turvalised ja mugavad makseviisid toob teieni ESTO Pay.

source: Pay in the bank
et: Maksa pangas

source: Payment is made using a secure payment solution called KEVIN (UAB “KEVIN EU”), which is licensed by the Bank of Lithuania.
et: Makse sooritamisel kasutatakse turvalist maksesüsteemi nimega KEVIN (UAB “KEVIN EU“), kellel on Leedu Keskpanga tegevusluba.

source: Show bank logos
et: Näita pankade logosid

source: This option enables showing country dropdown and bank logos
et: See säte lubab näidata riikide valikut ja pankade logosid

source: Bank logos layout
et: Pangalogode paigutus

source: 1 column
et: 1 tulp

source: Row
et: Rida

source: 2 columns
et: 2 tulpa

source: 3 columns
et: 3 tulpa

source: 4 columns
et: 4 tulpa

source: Specify countries for ESTO Pay method.
et: ESTO Pay maksemeetodi jaoks keelatud riigid

source: Please select a bank
et: Palun valige sobiv pank

source: ESTO X is an alternative ESTO payment method. For more information and activation please contact ESTO Partner Support.
et: ESTO X on ESTO alternatiivne maksemeetod. Lisainformatsiooni saamiseks võta ühendust ESTO partnertoega.

source: ESTO X payment gateway
et: ESTO X maksemoodul

source: Pay in 3 equal parts. At no extra charge.
et: Tasu 3 võrdse osana. Ilma ühegi lisatasuta.

source: ESTO 3 - pay without additional cost within 3 months! Just pay later.
et: ESTO 3 - maksa ilma lisatasudeta kolme kuu jooksul! Lihtsalt maksa hiljem.

source: Show calculator
et: Näita kalkulaatorit

source: Show calculator in payment method's description area in checkout.
et: Näita kassas selle maksemeetodi kirjelduses kalkulaatorit

source: %d interest-free payments over %d months
et: %d intressivaba makset %d kuu jooksul

source: Pay Later is an alternative ESTO payment method. For more information and activation please contact ESTO Partner Support.
et: Maksa Hiljem on ESTO alternatiivne maksemeetod. Lisainformatsiooni saamiseks võta ühendust ESTO partnertoega.

source: Buy now and pay later!
et: Osta nüüd ja maksa hiljem!

source: Just confirm your order with 3 clicks and take your time! Pay later, within 30 days, without any extra fees!
et: Kinnita oma tellimus 3 klikiga ja võta endale aega! Maksa hiljem, 30 päeva jooksul, ilma ühegi lisatasuta!
